# Pandas

**Pandas**
 Python'da veri manipülasyonu ve veri analizi için kullanılan güçlü bir kütüphanedir. Pandas'ın temel amacı, veriyi yapılandırılması, temizlenmesi, analiz edilmesi ve hazırlanması süreçlerini kolaylaştırmaktır. Pandas'ın temel özellikleri:

Veri Yapıları: Pandas, verileri işlemek için iki temel veri yapısı olan DataFrame ve Series sunar. DataFrame, veriyi iki boyutlu bir tablo olarak temsil ederken, Series tek boyutlu etiketli bir dizidir.

Veri Okuma ve Yazma: Pandas, çeşitli formatlardaki verileri okuyabilir ve yazabilir. Özellikle CSV, Excel, SQL veritabanları ve JSON gibi yaygın formatları destekler.

Veri Temizleme ve Düzenleme: Pandas, eksik verileri işleme, veri dönüştürme, filtreleme, sıralama ve yeniden şekillendirme gibi veri temizleme ve düzenleme işlemlerini kolaylaştırır.

Veri Analizi ve Keşif: Pandas, veri analizi için birçok işlev ve yöntem sağlar. Örneğin, istatistiksel hesaplamalar, gruplama, toplama, birleştirme ve zaman serisi analizi gibi işlemler yapılabilir.

Zaman Serisi İşlemleri: Pandas, zaman serisi verilerini işlemek için özel fonksiyonlar ve veri yapıları sağlar. Zaman serisi verilerini zaman damgalarıyla işaretlemek, dönemler ve frekanslar oluşturmak, zaman serisi analizi yapmak gibi işlemler gerçekleştirilebilir.

Veri Görselleştirme: Pandas, verileri görselleştirmek için matplotlib gibi diğer Python kütüphaneleriyle entegre çalışır. Grafikler, histogramlar, sütun grafikleri, kutu grafikleri ve dağılım grafikleri gibi çeşitli görselleştirmeler oluşturabilir.

Bu özellikler sayesinde Pandas, veri bilimi, makine öğrenimi, finansal analiz, iş zekası ve diğer birçok veri odaklı uygulama alanında yaygın olarak kullanılmaktadır.
Detaylı bilgi için bu adresi inceleyebilirsiniz


https://pandas.pydata.org/

Pandas'ta ***Serieler /Series***

pandas modülü veri işleme veri temizleme ve sql den yararlanrak yapIlır PANDAS burada key value ilşikisi vardır pd.Series(data,index) fakat çıktıda index başa gelir data bir yanına yazılır kütüphaneyi de
`import pandas as pd `
şeklinde yazarız

In [1]:
import numpy as np
import pandas as pd

C:\Users\irem_\AppData\Roaming\Python\Python311\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
labels_list=["irem","idil","gül"]
data_list=[10,20,30]
pd.Series(data=data_list,index=labels_list)
#burada pandası kullanarak seri oluşturduk pd.series() bu bizim herhangi bir seri oluşturmamızı sağlar

irem    10
idil    20
gül     30
dtype: int64

In [3]:
pd.Series(labels_list)

0    irem
1    idil
2     gül
dtype: object

In [4]:
pd.Series(index=data_list)

10   NaN
20   NaN
30   NaN
dtype: float64

serileri numpy kütüphanesi kullanarak yani arrayleri seri haline getirebiliriz

In [5]:
n=np.array([1,2,3])
pd.Series(n)

0    1
1    2
2    3
dtype: int32

In [6]:
pd.Series(data=n,index=("a","b","c"))

a    1
b    2
c    3
dtype: int32

serileri pythonda ki sözlük yapısı ile kullanabilir ve biz yine bu sözlüğü seri haline getiririz.

In [7]:
datadict={"sol":9,"la":8,"si":7}
pd.Series(datadict)

sol    9
la     8
si     7
dtype: int64

Serileri kendi içerisinde işlem yaptırabiliriz dikkat edilmesi gereken kısım ise iki seri içerindeki indexlerin birebir ayı isimle olmasıdır

In [8]:
ser2017=pd.Series([5,10,20],["elma","kiraz","erik"])
ser2018=pd.Series([30,40,50],["elma","üzüm","erik"])
total =ser2017+ser2018
total#burada yukarıda belirtiğimiz gibi aynı olmayan değerler toplanamadığı için NaN olarak karşımıza gelir .

elma     35.0
erik     70.0
kiraz     NaN
üzüm      NaN
dtype: float64

In [9]:
total["erik"]

70.0

***Dataframe***
serilerin yanyana gelmesi excel veya sql tablosu gbi bir çok serilerin birleşimidir.
column ,index ,datalardan oluşur şu şekilde yazılır
`pd.DataFrame(data,index,column)`

In [10]:
import pandas as pd
import numpy as np
from numpy.random import rand

In [11]:
rand(2)# rand fonksiyonu hatırlamk için örenek yaptım

array([0.42070513, 0.29453368])

In [12]:
rand(2,2)

array([[0.64970936, 0.83654121],
       [0.00973563, 0.69250641]])

In [13]:
df=pd.DataFrame(data=rand(2,2),index=["a","b"],columns=[1,2])
print(df)# bu şekilde istediğimiz şekilde dataframe oluşturduk

          1         2
a  0.619630  0.061885
b  0.701212  0.116938

In [14]:
df[1]#önceden biliğimiz gibi istediğimiz column  bu şekilde çağrırabiliriz

a    0.619630
b    0.701212
Name: 1, dtype: float64

In [15]:
type(df[1])

pandas.core.series.Series

In [16]:
df.loc["a"]
#index sorgulaması yaparsak bu şekilde yapılması .loc gerekir

1    0.619630
2    0.061885
Name: a, dtype: float64

In [17]:
df[[1,2]]
#burada column  sorgulamasıdır birden fazla column sorgulanabilir fakat iki tane köşeli parantez olması gerekir

          1         2
a  0.619630  0.061885
b  0.701212  0.116938

In [18]:
df[3]=pd.Series(rand(2),["a","b"])
df
#burda yeni bir sutün eklemek istersek

          1         2         3
a  0.619630  0.061885  0.409174
b  0.701212  0.116938  0.986574

In [19]:
df[4]=df[1]+df[2]+df[3]
df
#burda yeni eklediğimiz sutnünları toplayıp yeni bir sutünda yazdık

          1         2         3         4
a  0.619630  0.061885  0.409174  1.090690
b  0.701212  0.116938  0.986574  1.804724

In [20]:
df.drop(4,axis=1,inplace =True)#axis=1 column=1,row=0 sil demek
# burada istenilen sutün silinir inpladce true dememizin nedeni ise kalıcı hale getirmek default çünkü false gelir

In [21]:
df.iloc[0]
#iloc ta index ararken kullanılır fakat a dememe gerek yoktur

1    0.619630
2    0.061885
3    0.409174
Name: a, dtype: float64

In [22]:
df.loc["a",2]
#nokta değeri kullanırken de .loc kullanılır

0.061885361813327155

In [23]:
df.loc[["a","b"],[3]]#istenilen satır ve sutünları bu şekilde çağırabilirsiniz

          3
a  0.409174
b  0.986574

dataframe firtleme

In [24]:
import pandas as pd
import numpy as np
from numpy.random import randn
fil=pd.DataFrame(randn(4,3),["A","B","C","D"],["COLUMN1","COLUMN2","COLUMN3"])

In [25]:
fil

    COLUMN1   COLUMN2   COLUMN3
A -0.747891 -0.463294  1.226291
B  0.251466  0.567572 -0.472421
C -0.867433 -0.477819 -1.965082
D -1.243655 -0.599107  1.516733

In [26]:
fil>1
#bu koşulu sağlan true olur geri kalan false olur

   COLUMN1  COLUMN2  COLUMN3
A    False    False     True
B    False    False    False
C    False    False    False
D    False    False     True

In [27]:
booleanfil=fil>1

In [28]:
fil[booleanfil]
# yukarıda gözüktüğü gibi boolean fil biz ayrı tanımladık kendi için de filtreleme yaptık ve true olanlar kendi değerini korudu fakat false olanlar not a number (NaN) şeklinde çıktı

   COLUMN1  COLUMN2   COLUMN3
A      NaN      NaN  1.226291
B      NaN      NaN       NaN
C      NaN      NaN       NaN
D      NaN      NaN  1.516733

In [29]:
fil["COLUMN1"]

A   -0.747891
B    0.251466
C   -0.867433
D   -1.243655
Name: COLUMN1, dtype: float64

In [30]:
fil["COLUMN1"]> 1

A    False
B    False
C    False
D    False
Name: COLUMN1, dtype: bool

In [31]:
fil[fil["COLUMN1"]>0]

    COLUMN1   COLUMN2   COLUMN3
B  0.251466  0.567572 -0.472421

In [32]:
fil[fil["COLUMN1"]>-1]

    COLUMN1   COLUMN2   COLUMN3
A -0.747891 -0.463294  1.226291
B  0.251466  0.567572 -0.472421
C -0.867433 -0.477819 -1.965082

In [33]:
fil[(fil["COLUMN1"]>0 )& (fil["COLUMN1"]>-1)]
# pandas ta  and ve or semboller ile ifade edilir  & and sembolüdür | bu da or sembolüdür

    COLUMN1   COLUMN2   COLUMN3
B  0.251466  0.567572 -0.472421

In [34]:
fil[(fil["COLUMN1"]>0 ) | (fil["COLUMN1"]>-1)]

    COLUMN1   COLUMN2   COLUMN3
A -0.747891 -0.463294  1.226291
B  0.251466  0.567572 -0.472421
C -0.867433 -0.477819 -1.965082

In [35]:
fil["COLUMN4"]= pd.Series(randn(4),["A","B","C","D"])

In [36]:
fil

    COLUMN1   COLUMN2   COLUMN3   COLUMN4
A -0.747891 -0.463294  1.226291 -1.813399
B  0.251466  0.567572 -0.472421  0.439545
C -0.867433 -0.477819 -1.965082 -1.179635
D -1.243655 -0.599107  1.516733  0.203813

In [37]:
fil["COLUMN5"]= randn(4)

In [38]:
fil

    COLUMN1   COLUMN2   COLUMN3   COLUMN4   COLUMN5
A -0.747891 -0.463294  1.226291 -1.813399  0.702645
B  0.251466  0.567572 -0.472421  0.439545  0.062497
C -0.867433 -0.477819 -1.965082 -1.179635 -0.635424
D -1.243655 -0.599107  1.516733  0.203813  1.906720

In [39]:
fil ["column6"]=[1,2,3,4]

In [40]:
fil

    COLUMN1   COLUMN2   COLUMN3   COLUMN4   COLUMN5  column6
A -0.747891 -0.463294  1.226291 -1.813399  0.702645        1
B  0.251466  0.567572 -0.472421  0.439545  0.062497        2
C -0.867433 -0.477819 -1.965082 -1.179635 -0.635424        3
D -1.243655 -0.599107  1.516733  0.203813  1.906720        4

In [41]:
fil.set_index("column6")

          COLUMN1   COLUMN2   COLUMN3   COLUMN4   COLUMN5
column6
1       -0.747891 -0.463294  1.226291 -1.813399  0.702645
2        0.251466  0.567572 -0.472421  0.439545  0.062497
3       -0.867433 -0.477819 -1.965082 -1.179635 -0.635424
4       -1.243655 -0.599107  1.516733  0.203813  1.906720

In [42]:
fil.index.names

FrozenList([None])

In [43]:
fil

    COLUMN1   COLUMN2   COLUMN3   COLUMN4   COLUMN5  column6
A -0.747891 -0.463294  1.226291 -1.813399  0.702645        1
B  0.251466  0.567572 -0.472421  0.439545  0.062497        2
C -0.867433 -0.477819 -1.965082 -1.179635 -0.635424        3
D -1.243655 -0.599107  1.516733  0.203813  1.906720        4

In [44]:
fil.reset_index()#verdiğimiz indexleri siler 0 dan indexlemeye başlar burada da inplace var onu kullanıp kalıcı hale getirebilirsiniz

  index   COLUMN1   COLUMN2   COLUMN3   COLUMN4   COLUMN5  column6
0     A -0.747891 -0.463294  1.226291 -1.813399  0.702645        1
1     B  0.251466  0.567572 -0.472421  0.439545  0.062497        2
2     C -0.867433 -0.477819 -1.965082 -1.179635 -0.635424        3
3     D -1.243655 -0.599107  1.516733  0.203813  1.906720        4

In [45]:
new_index=["F","G","H","J"]

Data frame de multi index tanımlama burada önemli olan sırası ve sayısı buna dikkat edilmesi gerekir .
`pd.MultiIndex.from_tuples(hierarchy)`
burada multi index dizisini oluşturduk isterseniz array veya dataframe olarak düzenleip kullanabilirsiniz mantık olarak bir değerin birden fazla index durumu olduğunda kullanılır örenklerini aşağıda bulabilirsiniz

In [46]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [47]:
outher_index=["group1","group2","group3","group1","group2","group3"]
inner_index=["index1","index2","index3","index1","index2","index3"]

In [48]:
list(zip(outher_index,inner_index))

[('group1', 'index1'),
 ('group2', 'index2'),
 ('group3', 'index3'),
 ('group1', 'index1'),
 ('group2', 'index2'),
 ('group3', 'index3')]

In [49]:
hierarchy =list(zip(outher_index,inner_index))

In [50]:
hierarchy=pd.MultiIndex.from_tuples(hierarchy)

In [51]:
hierarchy

MultiIndex([('group1', 'index1'),
            ('group2', 'index2'),
            ('group3', 'index3'),
            ('group1', 'index1'),
            ('group2', 'index2'),
            ('group3', 'index3')],
           )

In [52]:
df =pd.DataFrame(randn(6,3),hierarchy,columns=["column1","column2","columns3"])

In [53]:
df

                column1   column2  columns3
group1 index1  0.946876  0.022715  1.373680
group2 index2  0.466014  1.036153  0.811216
group3 index3 -0.623556 -0.862229 -0.789548
group1 index1  1.499582  1.558871  0.613915
group2 index2 -0.840612 -0.550275 -0.294403
group3 index3  1.728735 -0.382953 -1.106492

In [54]:
ilk=["Spor","Spor","Spor","Sanat","Sanat"]
son=["Futbol","Basketbol","Tennis","Resim","Heykel"]

In [55]:
birlestirme=list(zip(ilk,son))
birlestirme

[('Spor', 'Futbol'),
 ('Spor', 'Basketbol'),
 ('Spor', 'Tennis'),
 ('Sanat', 'Resim'),
 ('Sanat', 'Heykel')]

In [56]:
birlestirme=pd.MultiIndex.from_tuples(birlestirme)
birlestirme

MultiIndex([( 'Spor',    'Futbol'),
            ( 'Spor', 'Basketbol'),
            ( 'Spor',    'Tennis'),
            ('Sanat',     'Resim'),
            ('Sanat',    'Heykel')],
           )

In [57]:
alan=[[1,"SP"],[2,"SP"],[3,"SP"],[4,"SN"],[5,"SN"]]

In [58]:
alanarray=np.array(alan)#Numpy

In [59]:
alandatframe=pd.DataFrame(alanarray,index=birlestirme,columns=["Number","Code"]) #dataframe pandas

In [60]:
alandatframe

                Number Code
Spor  Futbol         1   SP
      Basketbol      2   SP
      Tennis         3   SP
Sanat Resim          4   SN
      Heykel         5   SN

In [61]:
alandatframe.loc["Spor"]#.loc burada istenilen başlığın altındaki elamalrı çağırır

          Number Code
Futbol         1   SP
Basketbol      2   SP
Tennis         3   SP

In [62]:
alandatframe.loc["Spor"].loc["Tennis"]#elemaının kendisine ulaşmak istersek ikidefa .loc dememiz gerekir

Number     3
Code      SP
Name: Tennis, dtype: object

In [63]:
alandatframe.index.names=["Hobi","Name"]
alandatframe
#yeniden index ismi verebiliriz bunuda .index.names yazıp [ hangi başlığın altına gelmesi istiyorsam o satırları yazarız]

                Number Code
Hobi  Name
Spor  Futbol         1   SP
      Basketbol      2   SP
      Tennis         3   SP
Sanat Resim          4   SN
      Heykel         5   SN

dat ön işleme işlemi burada yapılır kayıp veriler ve bozuk veriler(missing value)

In [64]:
import  numpy as np
import pandas as pd

In [65]:
sozluk={"istanbul":[30,29,np.nan],"ankara":[20,np.nan,20],"antalya":[35,30,27]}
hava=pd.DataFrame(sozluk)

In [66]:
hava

   istanbul  ankara  antalya
0      30.0    20.0       35
1      29.0     NaN       30
2       NaN    20.0       27

eksik veriler (NaN )iki türlü düzeltebirisinz ya silme işlemi yapacaksınız ya da bu NaN değerleri doldurma işlemi yapmalısınz silme işlemi pek tercih edilen bir yöntem değildir

burada hem sözlük hemde numpy dizisini kullanarak iki türlü örnek vermek istedim

In [67]:
arr=np.array([[10,20,np.nan],[5,np.nan,np.nan],[20,np.nan,10]])

In [68]:
arr

array([[10., 20., nan],
       [ 5., nan, nan],
       [20., nan, 10.]])

In [69]:
df=pd.DataFrame(arr,index=["Index1","Index2","Index3"],columns =["Colum1","Column2","Column3"])

In [70]:
df

        Colum1  Column2  Column3
Index1    10.0     20.0      NaN
Index2     5.0      NaN      NaN
Index3    20.0      NaN     10.0

In [71]:
df.dropna()
#bunun içindeki axsis =0 ise index göre axsis=1 ise column göre siler
#dropna() aslında arkada başka bir değişkene eşitler isterseniz bir değişkenin içindede tutabilirsinz yada inplace true derseniz dataframe kalıcı olarak değiştirisiniz

Empty DataFrame
Columns: [Colum1, Column2, Column3]
Index: []

In [72]:
df

        Colum1  Column2  Column3
Index1    10.0     20.0      NaN
Index2     5.0      NaN      NaN
Index3    20.0      NaN     10.0

In [73]:
df.dropna(thresh=2)
#tresh bir indexte kaç tane NaN sayısı olmasını gerektiğini söyler bu şekilde filitreler 2 tane olanları siler burda birde  fark etiyseniz axis verilmediği için axis=0 olarka işlemi yapar

        Colum1  Column2  Column3
Index1    10.0     20.0      NaN
Index3    20.0      NaN     10.0

In [74]:
df

        Colum1  Column2  Column3
Index1    10.0     20.0      NaN
Index2     5.0      NaN      NaN
Index3    20.0      NaN     10.0

In [75]:
df.fillna(value=1)
# nan değerlerin yerine sabit bir değer atmak istersek kullanırız

        Colum1  Column2  Column3
Index1    10.0     20.0      1.0
Index2     5.0      1.0      1.0
Index3    20.0      1.0     10.0

In [76]:
df.sum().sum()
# burda 1 kere sum yazınca sadece tek tek column ları toplar ikiciyi yazınca tüm elemanlrı toplar

65.0

In [77]:
df.size
# size kaç tane elemanı sayısı olduğunu soyler

9

In [78]:
df.isnull().sum().sum()
# isnull nan değerleri sayısyını bulur 2 yazınca hepsini toplar

4

In [79]:
def Avargen(df):
  tottalsum=df.sum().sum()
  totalnum=df.size-df.isnull().sum().sum()
  return tottalsum/totalnum
  # ortalama bir değer oluşturma fonksiyonu yazarak filna kullanarak fonksiyonu çağırıp değer atama işlemi yapabilirsiniz

In [80]:
df.fillna(value=Avargen(df))

        Colum1  Column2  Column3
Index1    10.0     20.0     13.0
Index2     5.0     13.0     13.0
Index3    20.0     13.0     10.0

GRUPY
groupby sql deki gruplandırmaya benzer yapıdadır sql where koşulu sonrası gibi düşünmeliyiz yine burada sözluk kullanabilrsiniz .

In [81]:
dataset={"meyve":["elma","üzüm","nar","muz","elma","nar","erik"],
         "isim":["mustafa","jale","kadir","murat","ahmet","zeynep","irem"],
         "adet":[5,2,10,6,3,4,1]}

In [82]:
x=pd.DataFrame(dataset)

In [83]:
x

  meyve     isim  adet
0  elma  mustafa     5
1  üzüm     jale     2
2   nar    kadir    10
3   muz    murat     6
4  elma    ahmet     3
5   nar   zeynep     4
6  erik     irem     1

In [84]:
depgroup=x.groupby("meyve")
#neye göre gruplandırmak istersek .groupby("ismi") şeklinde yazmalıyız

In [85]:
depgroup

In [86]:
depgroup.describe()# describe özelliğni kullanabilriz

       adet
      count mean       std  min  25%  50%  75%   max
meyve
elma    2.0  4.0  1.414214  3.0  3.5  4.0  4.5   5.0
erik    1.0  1.0       NaN  1.0  1.0  1.0  1.0   1.0
muz     1.0  6.0       NaN  6.0  6.0  6.0  6.0   6.0
nar     2.0  7.0  4.242641  4.0  5.5  7.0  8.5  10.0
üzüm    1.0  2.0       NaN  2.0  2.0  2.0  2.0   2.0

In [87]:
depgroup.sum()

               isim  adet
meyve
elma   mustafaahmet     8
erik           irem     1
muz           murat     6
nar     kadirzeynep    14
üzüm           jale     2

In [88]:
x.groupby("meyve").sum()
#sql deki gruplama mantığı gibi gruplama yapılır her bir gruplamada adım adım gidilir burada meyveye göre grupladık

               isim  adet
meyve
elma   mustafaahmet     8
erik           irem     1
muz           murat     6
nar     kadirzeynep    14
üzüm           jale     2

In [89]:
x.groupby("meyve").sum().loc["nar"]
# burada meyvenin içerisinde ki toplam nar sayısını hesapladık nar burda bir eleman olduğu için index filitresi olan loc ile yaptık

isim    kadirzeynep
adet             14
Name: nar, dtype: object

In [90]:
depgroup.sum().loc["nar"]
#burda depgruop değişkeni oluşturup bir obje haline çervirdik

isim    kadirzeynep
adet             14
Name: nar, dtype: object

In [91]:
x.groupby("meyve").count()

       isim  adet
meyve
elma      2     2
erik      1     1
muz       1     1
nar       2     2
üzüm      1     1

In [92]:
x.groupby("meyve").max()

          isim  adet
meyve
elma   mustafa     5
erik      irem     1
muz      murat     6
nar     zeynep    10
üzüm      jale     2

In [93]:
x.groupby("meyve").min()["adet"]

meyve
elma    3
erik    1
muz     6
nar     4
üzüm    2
Name: adet, dtype: int64

In [94]:
x

  meyve     isim  adet
0  elma  mustafa     5
1  üzüm     jale     2
2   nar    kadir    10
3   muz    murat     6
4  elma    ahmet     3
5   nar   zeynep     4
6  erik     irem     1

In [95]:
x.groupby("meyve").min()["adet"]["elma"]

3

In [97]:
x.groupby("meyve")["adet"].mean()

meyve
elma    4.0
erik    1.0
muz     6.0
nar     7.0
üzüm    2.0
Name: adet, dtype: float64

merge join ve concatenate
-concatenate (birleştirme)burda iki farklı yerde aynı başlılar ile tablolar geliyormuş gibi düşünün ve bu tabloları .concat([1,2]) iki farklı dataframe (fakat sutün başlıkları aynı olmalı)
-merge (kaynaştırma) burada farkı ise sutünlar birebir aynı olması gerekmez sadece en az 1 tane ortak sutün olması gerekmektedir

In [98]:
data1={"A":["A1","A2","A3","A4"],
      "B":["B1","B2","B3","B4"],
      "C":["C1","C2","C3","C4"] }
data2={"A":["A5","A6","A7","A8"],
      "B":["B5","B6","B7","B8"],
      "C":["C5","C6","C7","C8"] }
df1 = pd.DataFrame(data1,index=[1,2,3,4])
df2 = pd.DataFrame(data2,index=[5,6,7,8])

In [99]:
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [100]:
df2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [101]:
pd.concat([df1,df2])

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [102]:
pd.concat([df1,df2],axis = 1)
#concat birbirine ekleme yapar axsis 0 ise indexe değilse 1 eşitse column göre ekler karşılık gelmeyen yereede nan değeri olarak ekler

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN   A8   B8   C8

In [103]:
data3={"A":["A1","A2","A3","A4"],
      "B":["B1","B2","B3","B4"],
       }
data4={"x":["x1","x2","x3"],
      "y":["y1","y2","y3"],
       }
df3 = pd.DataFrame(data3,index=[1,2,3,4])
df4 = pd.DataFrame(data4,index=[1,2,3])

In [104]:
df3

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [105]:
df4

    x   y
1  x1  y1
2  x2  y2
3  x3  y3

In [106]:
df3.join(df4)
# join de index göre left join yapar sql deki gibi

    A   B    x    y
1  A1  B1   x1   y1
2  A2  B2   x2   y2
3  A3  B3   x3   y3
4  A4  B4  NaN  NaN

In [107]:
df4.join(df3)

    x   y   A   B
1  x1  y1  A1  B1
2  x2  y2  A2  B2
3  x3  y3  A3  B3

In [108]:
data5={"A":["A1","A2","A3"],
      "B":["B1","B2","B3"],
       "anahtar":["k1","k2","k3"]}
data6={"x":["x1","x2","x3","x4"],
      "y":["y1","y2","y3","y4"],
      "anahtar":["k1","k2","k5","k4"]  }
df5 = pd.DataFrame(data5,index=[1,2,3])
df6 = pd.DataFrame(data6,index=[1,2,3,4])

In [109]:
df5

    A   B anahtar
1  A1  B1      k1
2  A2  B2      k2
3  A3  B3      k3

In [110]:
df6

    x   y anahtar
1  x1  y1      k1
2  x2  y2      k2
3  x3  y3      k5
4  x4  y4      k4

In [111]:
pd.merge(df5,df6 ,on="anahtar")
# burda data sette ki hangi column istersek ona göre iki kümeninin kesişimi gibi çıktı veririr

    A   B anahtar   x   y
0  A1  B1      k1  x1  y1
1  A2  B2      k2  x2  y2

Dataframe opresyonları

In [112]:
z=pd.DataFrame({"column1":[1,2,3,4,5,6],
                "column2":[100,100,300,200,300,100],
                "column3":["mustafa","kamil","emre","ayşe","murat","zeynep"]})

In [113]:
z

   column1  column2  column3
0        1      100  mustafa
1        2      100    kamil
2        3      300     emre
3        4      200     ayşe
4        5      300    murat
5        6      100   zeynep

In [114]:
z.head (n=3)
#ilk 3 satırı döndürür

   column1  column2  column3
0        1      100  mustafa
1        2      100    kamil
2        3      300     emre

In [115]:
z["column2"].unique()
# istenilen kolumn da eşssiz değerleri bulur

array([100, 300, 200], dtype=int64)

In [116]:
z["column2"].nunique()
# burada kaç tane eşsiz  olduğunu söyler

3

In [117]:
z["column2"].value_counts()# kaç tane aynı değerden olduğunu söyler

column2
100    3
300    2
200    1
Name: count, dtype: int64

In [118]:
z.isnull()#isnull yani NaN değerleri getir True varsa NaN değer vardır

   column1  column2  column3
0    False    False    False
1    False    False    False
2    False    False    False
3    False    False    False
4    False    False    False
5    False    False    False

In [119]:
z.isnull().sum() #burdada hang sutünda kaç tane NaN değeri olan toplamı çıktısı alınır

column1    0
column2    0
column3    0
dtype: int64

In [120]:
z[(z["column1"]>=4) & (z["column2"]== 300)]# flitreleme koşul koyabilirsiniz

   column1  column2 column3
4        5      300   murat

In [121]:
z["column2"]*3

0    300
1    300
2    900
3    600
4    900
5    300
Name: column2, dtype: int64

In [122]:
def carp(d):
  return d*3 # fonksiyon oluşturup dataframe uygulama yapabilirsiniz

In [123]:
z["column2"].apply(carp)

0    300
1    300
2    900
3    600
4    900
5    300
Name: column2, dtype: int64

In [124]:
z["column2"]=z["column2"].apply(carp)

In [125]:
z

   column1  column2  column3
0        1      300  mustafa
1        2      300    kamil
2        3      900     emre
3        4      600     ayşe
4        5      900    murat
5        6      300   zeynep

In [126]:
z["column3"].apply(len)

0    7
1    5
2    4
3    4
4    5
5    6
Name: column3, dtype: int64

In [127]:
z.columns

Index(['column1', 'column2', 'column3'], dtype='object')

In [128]:
z.index

RangeIndex(start=0, stop=6, step=1)

In [129]:
len(z.index)

6

In [130]:
len(z.columns)

3

In [131]:
z.index.names

FrozenList([None])

In [132]:
z.sort_values("column3",ascending=False)

   column1  column2  column3
5        6      300   zeynep
0        1      300  mustafa
4        5      900    murat
1        2      300    kamil
2        3      900     emre
3        4      600     ayşe

In [133]:
z.sort_values("column3")

   column1  column2  column3
3        4      600     ayşe
2        3      900     emre
1        2      300    kamil
4        5      900    murat
0        1      300  mustafa
5        6      300   zeynep

In [134]:
c=pd.DataFrame({"ay":["temmuz","mart","nisan"],
             "şehir":["antalya","ankara","istanbul"],
             "nem":[80,30,40]})

In [135]:
c

       ay     şehir  nem
0  temmuz   antalya   80
1    mart    ankara   30
2   nisan  istanbul   40

pivot table
veri setlerini düzenler istediğimiz halde sütunu ve satır bilgilrini düzenleyerek gösterir

In [136]:
c.pivot_table(index="ay",columns="şehir",values="nem")

şehir   ankara  antalya  istanbul
ay
mart      30.0      NaN       NaN
nisan      NaN      NaN      40.0
temmuz     NaN     80.0       NaN